In [1]:
import numpy as np
import datetime as dt
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
%matplotlib inline

In [42]:
prescriptions2014 = pd.read_csv('data/Prescribing_Rate_2014.csv')
prescriptions2015 = pd.read_csv('data/Prescribing_Rate_2015.csv')
prescriptions2016 = pd.read_csv('data/Prescribing_Rate_2016.csv')
prescriptions2017 = pd.read_csv('data/Prescribing_Rate_2017.csv')

In [44]:
allprescriptions = pd.concat([prescriptions2014, prescriptions2015, prescriptions2016, prescriptions2017])
allprescriptions.head(2)

   Year    State State ABBR  Prescribing Rate
0  2014  Alabama         AL             135.2
1  2014   Alaska         AK              62.7

In [45]:
allprescriptions.to_csv('prescriptions.csv')

In [72]:
death_count = pd.read_csv('data/Drug_Overdose_Mortality_deaths.csv')
death_count.head()

        STATE STATE_ABBR   2014   2015   2016   2017  Unnamed: 6
0     Alabama         AL    723    736    756    835         NaN
1      Alaska         AK    124    122    128    147         NaN
2     Arizona         AZ  1,211  1,274  1,382  1,532         NaN
3    Arkansas         AR    356    392    401    446         NaN
4  California         CA  4,521  4,659  4,654  4,868         NaN

In [71]:
death_counts = death_count.dropna()
death_counts.tail(2)

Empty DataFrame
Columns: [STATE, STATE_ABBR, 2014, 2015, 2016, 2017, Unnamed: 6]
Index: []

In [74]:
death_rate = pd.read_csv('data/Drug_Overdose_Mortality_Rate.csv')
death_rate.head(2)

     STATE STATE_ABBR  2014  2015  2016  2017
0  Alabama         AL  15.2  15.7  16.2  18.0
1   Alaska         AK  16.8  16.0  16.8  20.2

In [63]:
deaths_rate = death_rate.dropna()
deaths_rate.tail(2)

        STATE STATE_ABBR  2014  2015  2016  2017
48  Wisconsin         WI  15.1  15.5  19.3  21.2
49    Wyoming         WY  19.4  16.4  17.6  12.2